; domain
(define (domain HARBOR_V05)
  (:requirements :strips :typing :fluents)
  (:types block o_block stack crane bottom doc tape)
  (:predicates (hold ?c - crane ?x - (either block o_block))
  	       (empty_crane ?c - crane)
	       (empty_tape ?t - tape)
	       (block_in_tape ?x - (either block o_block) ?t - tape)
	       (available ?x - o_block)
	       (on ?x - (either o_block block) ?y - (either o_block block bottom) )
	       (top ?x - (either block bottom o_block))
	       (at ?x - (either block bottom o_block) ?s - stack)
	       (at_dock ?x - (either block o_block bottom) ?d - dock)
	       (handle ?c - crane ?s - (either stack tape))
  )
  (:functions 
    (stack_height ?s - stack)
    (max_height)
  )
  (:action pick-from-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (decrease (stack_height ?s) 1))
  )

  (:action pick-from-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (decrease (stack_height ?s) 1))
  )

  (:action pick-from-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (not (available ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (decrease (stack_height ?s) 1))
  )

  (:action pick-from-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (empty_crane ?c)
                       (handle ?c ?s)
		       (at ?x ?s)
		       (top ?x)
		       (on ?x ?y)
		       (at_dock ?x ?d))
    :effect (and (not (empty_crane ?c))
                 (hold ?c ?x)
		 (not (on ?x ?y))
		 (not (at ?x ?s))
		 (not (top ?x))
		 (top ?y)
		 (not (at_dock ?x ?d))
		 (available ?y)
		 (decrease (stack_height ?s) 1))
  )

  (:action put-on-stack-bb
    :parameters (?x - block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (< (stack_height ?s) (max_height)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (increase (stack_height ?s) 1))
  )

  (:action put-on-stack-oo
    :parameters (?x - o_block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (< (stack_height ?s) (max_height)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
		 (increase (stack_height ?s) 1))
  )



  (:action put-on-stack-ob
    :parameters (?x - o_block ?y - (either block bottom) ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (< (stack_height ?s) (max_height)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (available ?x)
		 (increase (stack_height ?s) 1))
  )

  (:action put-on-stack-bo
    :parameters (?x - block ?y - o_block ?s - stack ?c - crane ?d - dock)
    :precondition (and (hold ?c ?x)
                       (handle ?c ?s)
    		       (top ?y)
		       (at ?y ?s)
		       (at_dock ?y ?d)
		       (< (stack_height ?s) (max_height)))
    :effect (and (empty_crane ?c)
                 (not (hold ?c ?x))
		 (on ?x ?y)
		 (at ?x ?s)
		 (top ?x)
		 (not (top ?y))
		 (at_dock ?x ?d)
		 (not (available ?y))
		 (increase (stack_height ?s) 1))
  )

  (:action pick-from-tape
    :parameters (?x - (either block o_block) ?c - crane ?t - tape)
    :precondition (and (block_in_tape ?x ?t)
                       (empty_crane ?c)
		       (handle ?c ?t))
		       
    :effect (and (not (block_in_tape ?x ?t)) (not (empty_crane ?c))
                 (empty_tape ?t) (hold ?c ?x))
  )

  (:action put-on-tape
    :parameters (?x - (either block o_block) ?c - crane ?t - tape)
    :precondition (and (empty_tape ?t)
                       (hold ?c ?x)
		       (handle ?c ?t))
		       
    :effect (and (block_in_tape ?x ?t) (empty_crane ?c)
                 (not (empty_tape ?t)) (not (hold ?c ?x)))
  )
)

; problem
(define (problem HARBOR_SIMPLE_V05)
(:domain HARBOR_V05)
(:objects C1 C2 - crane
	  B1 - block
          B2 - o_block
          S1 S2 - stack
          BOT1 BOT2 - bottom
          D1 D2 - dock
          T1 - tape)
(:init
       (= (max_height) 3)
       (empty_crane C1)
       (empty_crane C2)
       (empty_tape T1)
       (handle C1 S1)
       (handle C2 S2)
       (handle C1 T1) ; These were missing
       (handle C2 T1)
       (= (stack_height S1) 1)
       (= (stack_height S2) 1)
       (on B1 BOT1)
       (at B1 S1)
       (at_dock B1 D1)
       (at_dock BOT1 D1)
       (at BOT1 S1)
       (top B1)

       (on B2 BOT2)
       (at B2 S2)
       (at_dock B2 D2)
       (at_dock BOT2 D2)
       (at BOT2 S2)
       (available B2)
       (top B2)
)

(:goal (and (available B2) (at_dock B2 D1))))

; plan
1. (pick-from-stack-ob b2 bot2 s2 c2 d2)
   deleted: (empty_crane c2) (on b2 bot2) (at b2 s2) (top b2) (available b2) (at_dock b2 d2)
   added: (hold c2 b2) (top bot2)
   changed: (stack_height s2) from 1 to 0
   goals met: 0 of 2
2. (put-on-tape b2 c2 t1)
   deleted: (empty_tape t1) (hold c2 b2)
   added: (block_in_tape b2 t1) (empty_crane c2)
   goals met: 0 of 2
3. (pick-from-tape b2 c1 t1)
   deleted: (block_in_tape b2 t1) (empty_crane c1)
   added: (empty_tape t1) (hold c1 b2)
   goals met: 0 of 2
4. (put-on-stack-ob b2 b1 s1 c1 d1)
   deleted: (hold c1 b2) (top b1)
   added: (empty_crane c1) (on b2 b1) (at b2 s1) (top b2) (at_dock b2 d1) (available b2)
   changed: (stack_height s1) from 1 to 2
   goals met: 2 of 2
